In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
my_list = [10,20,30]

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
label = ['a','b','c']

In [6]:
pd.Series(data=my_list,index = label)

a    10
b    20
c    30
dtype: int64

In [7]:
#convert numpy array to PD Series
arr = np.array(my_list)

In [9]:
mySeries = pd.Series(data=arr)

In [10]:
mySeries

0    10
1    20
2    30
dtype: int32

In [11]:
pd.Series(data=arr,index=label)

a    10
b    20
c    30
dtype: int32

In [13]:
#using dictionary
d = {1:'Sunday',2:'Monday',3:'Tuesday'}
pd.Series(d)
pd.Series(data=d)

1     Sunday
2     Monday
3    Tuesday
dtype: object

In [14]:
#indexing
ser1 = pd.Series([1,2,3,4],index=['USA','CANADA','MEXICO','BRAZIL'])

In [15]:
ser1

USA       1
CANADA    2
MEXICO    3
BRAZIL    4
dtype: int64

In [16]:
ser1[0]

1

In [17]:
ser1['USA']

1

In [18]:
ser2 = pd.Series([3,4,5,6],index=['USA','Germany','BRAZIL','France'])

In [19]:
ser2

USA        3
Germany    4
BRAZIL     5
France     6
dtype: int64

In [20]:
ser1 + ser2

BRAZIL     9.0
CANADA     NaN
France     NaN
Germany    NaN
MEXICO     NaN
USA        4.0
dtype: float64

In [22]:
np.random.seed(233)
df  = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D'],columns='W X Y Z'.split())

In [23]:
df

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056
E -0.261848  1.835768  2.374020  2.299791

In [25]:
#Selection and Indexing
df['W']

A    0.881364
B   -0.189844
C    0.365762
D   -0.696658
E   -0.261848
Name: W, dtype: float64

In [26]:
#multiple columns
df[['W','Z']]

          W         Z
A  0.881364 -0.408383
B -0.189844 -1.544336
C  0.365762 -0.480773
D -0.696658 -0.043056
E -0.261848  2.299791

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
df['NEW'] = df['W'] + df['Y']

In [29]:
df

          W         X         Y         Z       NEW
A  0.881364  0.183367 -0.950251 -0.408383 -0.068887
B -0.189844 -0.985797 -1.191522 -1.544336 -1.381366
C  0.365762  1.455482 -1.541712 -0.480773 -1.175950
D -0.696658  0.062271  1.415809 -0.043056  0.719151
E -0.261848  1.835768  2.374020  2.299791  2.112172

In [30]:
df

          W         X         Y         Z       NEW
A  0.881364  0.183367 -0.950251 -0.408383 -0.068887
B -0.189844 -0.985797 -1.191522 -1.544336 -1.381366
C  0.365762  1.455482 -1.541712 -0.480773 -1.175950
D -0.696658  0.062271  1.415809 -0.043056  0.719151
E -0.261848  1.835768  2.374020  2.299791  2.112172

In [31]:
#Remove Column without effecting the original df
df.drop('NEW',axis=1)

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056
E -0.261848  1.835768  2.374020  2.299791

In [32]:
df

          W         X         Y         Z       NEW
A  0.881364  0.183367 -0.950251 -0.408383 -0.068887
B -0.189844 -0.985797 -1.191522 -1.544336 -1.381366
C  0.365762  1.455482 -1.541712 -0.480773 -1.175950
D -0.696658  0.062271  1.415809 -0.043056  0.719151
E -0.261848  1.835768  2.374020  2.299791  2.112172

In [33]:
#remove from original
df.drop('NEW',axis=1,inplace=True)

In [34]:
df

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056
E -0.261848  1.835768  2.374020  2.299791

In [35]:
#drop rows (add inplace=True to modify original)
df.drop('E',axis=0)

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056

In [36]:
df

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056
E -0.261848  1.835768  2.374020  2.299791

In [37]:
df['Y']

A   -0.950251
B   -1.191522
C   -1.541712
D    1.415809
E    2.374020
Name: Y, dtype: float64

In [38]:
#selecting rows
df.loc['A']

W    0.881364
X    0.183367
Y   -0.950251
Z   -0.408383
Name: A, dtype: float64

In [39]:
#select rows based on position
df.iloc[2]

W    0.365762
X    1.455482
Y   -1.541712
Z   -0.480773
Name: C, dtype: float64

In [40]:
#subset of rows and columns 
df.loc['B','Y']

-1.1915223226219838

In [ ]:
#multiple dimension
df.loc[list,list]

In [41]:
df.loc[['A','C'],['X','Z']]

          X         Z
A  0.183367 -0.408383
C  1.455482 -0.480773

In [42]:
#conditional selection
df

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056
E -0.261848  1.835768  2.374020  2.299791

In [43]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False  False  False  False
C   True   True  False  False
D  False   True   True  False
E  False   True   True   True

In [44]:
df[df>0]

          W         X         Y         Z
A  0.881364  0.183367       NaN       NaN
B       NaN       NaN       NaN       NaN
C  0.365762  1.455482       NaN       NaN
D       NaN  0.062271  1.415809       NaN
E       NaN  1.835768  2.374020  2.299791

In [45]:
df[df['W']>0]

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
C  0.365762  1.455482 -1.541712 -0.480773

In [46]:
#selection based on criteria and view only column Y
df[df['W']>0]['Y']

A   -0.950251
C   -1.541712
Name: Y, dtype: float64

In [47]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.183367 -0.950251
C  1.455482 -1.541712

In [55]:
df[(df['W']>0) & (df['Y'] < 1)]

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
C  0.365762  1.455482 -1.541712 -0.480773

In [ ]:
or = |
and = &

In [52]:
df

          W         X         Y         Z
A  0.881364  0.183367 -0.950251 -0.408383
B -0.189844 -0.985797 -1.191522 -1.544336
C  0.365762  1.455482 -1.541712 -0.480773
D -0.696658  0.062271  1.415809 -0.043056
E -0.261848  1.835768  2.374020  2.299791

In [56]:
#resets to default numeric index
df.reset_index()

  index         W         X         Y         Z
0     A  0.881364  0.183367 -0.950251 -0.408383
1     B -0.189844 -0.985797 -1.191522 -1.544336
2     C  0.365762  1.455482 -1.541712 -0.480773
3     D -0.696658  0.062271  1.415809 -0.043056
4     E -0.261848  1.835768  2.374020  2.299791

In [58]:
df.reset_index(inplace=True)

In [59]:
df

  index         W         X         Y         Z
0     A  0.881364  0.183367 -0.950251 -0.408383
1     B -0.189844 -0.985797 -1.191522 -1.544336
2     C  0.365762  1.455482 -1.541712 -0.480773
3     D -0.696658  0.062271  1.415809 -0.043056
4     E -0.261848  1.835768  2.374020  2.299791

In [60]:
df['States'] = 'LA NY CA FL TX'.split()

In [61]:
df

  index         W         X         Y         Z States
0     A  0.881364  0.183367 -0.950251 -0.408383     LA
1     B -0.189844 -0.985797 -1.191522 -1.544336     NY
2     C  0.365762  1.455482 -1.541712 -0.480773     CA
3     D -0.696658  0.062271  1.415809 -0.043056     FL
4     E -0.261848  1.835768  2.374020  2.299791     TX

In [62]:
df.set_index('States')

       index         W         X         Y         Z
States
LA         A  0.881364  0.183367 -0.950251 -0.408383
NY         B -0.189844 -0.985797 -1.191522 -1.544336
CA         C  0.365762  1.455482 -1.541712 -0.480773
FL         D -0.696658  0.062271  1.415809 -0.043056
TX         E -0.261848  1.835768  2.374020  2.299791

In [64]:
df.set_index('States',inplace=True)

In [65]:
df

       index         W         X         Y         Z
States
LA         A  0.881364  0.183367 -0.950251 -0.408383
NY         B -0.189844 -0.985797 -1.191522 -1.544336
CA         C  0.365762  1.455482 -1.541712 -0.480773
FL         D -0.696658  0.062271  1.415809 -0.043056
TX         E -0.261848  1.835768  2.374020  2.299791

In [68]:
pd.__version__

'1.0.5'